a = [1, 5, 'Good', 'Bad']
b = [9, 'Blue', 'Red', 11]
print(a[1] + b[3])
print(a[2] + b[2])
print(a[0] * b[0])
print(a[1] ** b[3])
print(a + b)

a = 'Шляпка гриба, покрытая ... кожиц..й, держится на ... ножк.. . Снизу шляпка затянута ... пленкой. Когда ее уберешь, откроется нижняя ... сторона шляпк'
print(a)
print('покрытая...')
a1 = input()
print('кожиц..й')
a2 = input()
print('держится на ...')
a3 = input()
print('ножк...')
a4 = input()
print('затянута ...')
a5 = input()
print('нижняя...')
a6 = input()
print('Шляпка гриба, покрытая {a1} кожиц..й {a2}, держится на ... ножк.. . Снизу шляпка затянута ... пленкой. Когда ее уберешь, откроется нижняя ... сторона шляпк')
